Backend/app/Controllers/DAO/Province.php

SELECT `province`.`id_province`, `province`.`name`, COUNT(university.id_university) AS university_count
FROM `province`
LEFT JOIN `university` ON `university`.`id_province` = `province`.`id_province`
GROUP BY `province`.`id_province`
---
    public static function getProvincesWithUniversityCount(): array
    {
        // Requête pour obtenir les provinces et le nombre d'universités
        $builder = self::getInstance()->model->builder();

        $builder->select('province.id_province, province.name, COUNT(university.id_university) AS university_count');
        $builder->join('university', 'university.id_province = province.id_province', 'left');
        $builder->groupBy('province.id_province');

        return $builder->get()->getResultArray();